def file(file):
    '''r 只读；w 覆盖写入，没有文件则创建，不可读；a 追加写入，没有则创建，不可读
    r+, 读写，写的时候是追加写入的，最常用
    w+, 先写入，再读取，如果有文件，则先覆盖写入，再读取，没啥用
    a+，追加写入读取,默认文件指针处在文件的末尾，如果要读取，必须先f.seek(0)，
        而无论文件指针处在什么位置，只要写入，就写在文件末尾
    rb，wb，ab，二进制的读取写入等
    rU，r+U,读取文件时替换\r\n,\n等为\n'''
    with open(file,'r',encoding='utf-8') as f:
        content = f.read() # 一次性读取文件所有内容，如果文件过大，内存溢出的话，不能读取全部内容!
        f.readlines()  # 一次性读取所有文件的行，生成一个列表，效率低
        f.readline()   # 读取文件的一行，效率高
        f.tell()       # 获取文件的指针所在字节位置
        f.seek()       # 移动文件的指针
        f.flush()      # 刷新缓存，直接将文件写入
        f.truncate(8)  # 截取文件前8个字节
        for line in f: # 读取文件的一行，效率高
            print(line)